README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-20 Tue 19:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OBHPC example codes</title>
<meta name="author" content="yaspr" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OBHPC example codes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb983727">1. Introduction</a>
<ul>
<li><a href="#org796891e">1.1. Playlist while writing these codes:</a></li>
<li><a href="#org5600b17">1.2. <span class="underline"><b>src</b></span> directory content</a>
<ul>
<li><a href="#orgf8a5154">1.2.1. Encrytion</a></li>
<li><a href="#org86f4f12">1.2.2. Linear algebra</a></li>
<li><a href="#org4f54607">1.2.3. Bitwise hacks</a></li>
<li><a href="#orgd100bd2">1.2.4. <span class="todo TODO">TODO</span> (add codes for the following subjects)</a></li>
</ul>
</li>
<li><a href="#orgea0eb9b">1.3. <span class="underline"><b>doc</b></span> directory content</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb983727" class="outline-2">
<h2 id="orgb983727"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This directory contains example C codes meant as a reference implementation for newbies.
Happy hacking :] - Yaspr 2022 (yaspr@protonmail.com)
</p>

<p>
<span class="underline">NOTE</span>: These codes are sometimes badly written on purpose. They are either meant to be optimized or to
showcase inadequate algorithms, bad programming practices &amp; code patterns that break compiler optimizations.
</p>
</div>

<div id="outline-container-org796891e" class="outline-3">
<h3 id="org796891e"><span class="section-number-3">1.1.</span> Playlist while writing these codes:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Tool (Lateralus, 10.000 days, Fear Inoculum, &#x2026;)</li>
<li>Periphery (Blood Eagle, Lune, Absolomb, &#x2026;)</li>
<li>Meshuggah (Bleed, Dancers to a discordant sytem, &#x2026;)</li>
<li>Anup Sastry (Illuminate, This World, &#x2026;)</li>
<li>GoGo Penguin (Quiet Fire, &#x2026;)</li>
<li>Mammal hands</li>
<li>Snarky Puppy (Lingus, &#x2026;)</li>
<li>Slipknot (Vermillion, Duality, AOV, &#x2026;)</li>
<li>Rammstein (Deutschland, Kein Lust, Feuer Frei, &#x2026;)</li>
<li>Joe Satriani (Made of tears, Surfing with the aliens, God is crying, &#x2026;)</li>
<li>Miles Davis (Sketches of Spain)</li>
<li>Allen Toussaint</li>
<li>Stevie Ray Vaughan</li>
<li>Christian Loffler - York</li>
<li>Bonobo - Cirrus</li>
</ul>
</div>
</div>

<div id="outline-container-org5600b17" class="outline-3">
<h3 id="org5600b17"><span class="section-number-3">1.2.</span> <span class="underline"><b>src</b></span> directory content</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf8a5154" class="outline-4">
<h4 id="orgf8a5154"><span class="section-number-4">1.2.1.</span> Encrytion</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>File encryption using XOR and automatic key generation</li>
<li>RSA encryption implementation</li>
<li>Steganography using the PPM image format</li>
<li>AES - 128 bit / 16 bytes key</li>
<li>RSA - 64 bit integers based implementation</li>
</ul>
</div>
</div>

<div id="outline-container-org86f4f12" class="outline-4">
<h4 id="org86f4f12"><span class="section-number-4">1.2.2.</span> Linear algebra</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Implementation of the Jacobi method for solving systems of linear equations</li>
<li>Implementation of the Cholesky decomposition algorithm</li>
<li>Implementation of the Conjugate-Gradient algorithm for solving systems of linear equations</li>

<li>m: 5.0 - Matrix generator (diagonal, upper and lower triangular, dense, sparse? )</li>
<li>m: 5.1 - Matrix transposition</li>

<li>m: 5.2 - Naive square matrix multiplication (2D storage) with performance measurement and comparison</li>
</ul>
<p>
For the 5.2 code, the test matrices archives should be extracted.
</p>

<ul class="org-ul">
<li>m: 5.3 - Naive square matrix multiplication (1D storage) with performance measurement and comparison</li>

<li>Implementation of Newton-Raphson for finding the root of a function</li>

<li>Butterfly curve</li>
<li>Integration using Trapezoidal rule</li>
<li>Double pendulum simulation</li>
<li>Ray casting</li>
<li>Gray-Scott gas diffusion algorithm</li>
<li>Ikeda map</li>
<li>Taylor series</li>
<li>Hamming distance of two buffers</li>
<li>PPM editor</li>
<li>PGM Image filtering with convolution (Sobel filter, Edge filters, Sharpening filter, Blox Blur, Gaussian Blur, Kirsch filter, Prewitt filter)</li>
<li>Delta space exploration game</li>
<li>Floating point summation with Kahan, Neumaeir, Pairwise, and naive algorithms</li>
<li>An implementation of a blockchain (reward based scheme)</li>
<li>Fourier visualization</li>
<li>Craig Reynold's steering algorithm (UFOs)</li>
<li>Histogram of a PGM image (plot using gnuplot)</li>
<li>Boyer-Moore searching algorithm</li>
<li>OpenCV camera image filtering</li>
</ul>
</div>
</div>

<div id="outline-container-org4f54607" class="outline-4">
<h4 id="org4f54607"><span class="section-number-4">1.2.3.</span> Bitwise hacks</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>Bitwise POPCOUNT &amp; LEFT MOST BIT</li>
<li>Square root implementation</li>
</ul>
</div>
</div>

<div id="outline-container-orgd100bd2" class="outline-4">
<h4 id="orgd100bd2"><span class="section-number-4">1.2.4.</span> <span class="todo TODO">TODO</span> (add codes for the following subjects)</h4>
<div class="outline-text-4" id="text-1-2-4">
<ul class="org-ul">
<li>Neural network (Simple perceptron)</li>
<li>DFT &amp; FFT</li>
<li>Eigen value (Power iteration, Inverse iteration, QR, Arnoldi, Bisection, &#x2026;)</li>
<li>Sound processing (sound generation, noise filtering, equalization, &#x2026;)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgea0eb9b" class="outline-3">
<h3 id="orgea0eb9b"><span class="section-number-3">1.3.</span> <span class="underline"><b>doc</b></span> directory content</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Ariane5 explosion video. The explosion was due to a software error (bad type conversion).
A reminder of how catastrophic code bugs can be.</li>

<li>A book on computational physics</li>
<li>References for understanding the AES &amp; Speck algorithms. Speck was designed by NSA :]</li>
<li>References on Error Detection &amp; Correction</li>
<li>Slides on the Eigen value problem</li>
<li>One of the reference papers on the FFT &amp; its applications</li>
<li>Floating point references (IEEE754 specification, &#x2026;)					  [ MUST READ ]</li>
<li>References on Huffman encoding and decoding</li>
<li>An interesting Reading List for developers compiled by Intel and two very useful white papers  [ MUST READ ]</li>
<li>String searching algorithms									  [ MUST READ ]</li>
<li>References on matrix Eigen value algorithms and cache obliviousness				  [ MUST READ ]</li>
<li>References on Molecular Dynamics</li>
<li>A reference on mutation detection in genetic codes</li>
<li>A book on numerical algorithms								  [ MUST READ ]</li>
<li>The book: Numerical Recipes in C								  [ MUST READ ]</li>

<li>The amazing paper: Reflections on Trusting Trust, by Ken Thompson (the creator of UNIX and a great
contributor to the C programming language &amp; environment - a brilliant yet humble mind).
The paper presents a PoC (Proof of Concept) for a software virus/worm that targets compilers.
The concept is to infect a compiler so that, every time a code is compiled and a program generated,
the compiler injects malicious code (backdoor, &#x2026;) into the generated program. This way, the virus/worm
won't have to deploy additional sophisticated spreading mechanisms.
For example: what if the GCC repository is infected and it goes unnoticed. All codes compiled with GCC
will be dragging malicious code and millions of critical computer systems will be affected.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yaspr</p>
<p class="date">Created: 2022-09-20 Tue 19:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
